app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      begin
        @songs = Artist.find(params[:artist_id]).songs
      rescue
        flash[:alert] = "Artist not found."
        redirect_to artists_path
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"

  def show
    if params[:artist_id]
      begin
        @song = Artist.find(params[:artist_id]).songs.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1], ["LIMIT", 1]]